#Область ПрограммныйИнтерфейс

Процедура ПриИзмененииСтрокиТабличнойЧасти(Форма) Экспорт
	
	ТекущиеДанные = Форма.Элементы.Товары.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьСуммуВСтрокеТабличнойЧасти(ТекущиеДанные);
	Форма.Объект.СуммаДокумента = Форма.Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти)
	
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

#КонецОбласти
